---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotAddToGroupFormat
source: html/0e188fc3-72e6-15c0-52f1-78dc43ab053c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotAddToGroupFormat Property

[Element] cannot be added to the instance of [Group]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddToGroupFormat { get; }
```